/**
@mainpage
@author Artem Kasyanov
@date 20.12.2020
@version 1.0
*/
#include <stdio.h>
/**
@brief Ця функція вираховує кількість щасливих білетів, та визначає чи належить заданий білет до щасливих, чи ні.
Порядок дій такий:
	- Створюється цикл, що буде обробляти кожне число від 100000 до 999999
	- Кожна цифра числа вираховується окремо, та перетворюється на одиниці.
	- Вираховується сума перших трьох та останніх трьох цифр.
	- Якщо sum1 та sum2 однакові, цей білет є щасливим! Лічильник збільшується, а наш білет порівнюється с ци щасливим.
	- Після усіх ітерацій, повертаєтсья значення *lucky*, яке може набувати значення 0 або 1.
@param[in] number Перший аргумент записується у цей параметр.
*/
int luckycount(int number){
	int a,b,c,d,e,f,lucky=0,sum1,sum2,counter=0;
	for(int lim=100000;lim<=999999 && lim>99999;lim++){
		f=lim%10;
		e=(lim-f)%100/10;
		d=(lim-e*10-f)%1000/100;
		c=(lim-d*100-e*10-f)%10000/1000;
		b=(lim-c*1000-d*100-e*10-f)%100000/10000;
		a=(lim-b*10000-c*1000-d*100-e*10-f)%1000000/100000;
		sum1=a+b+c;
		sum2=d+e+f;
		if(sum1==sum2){
			counter++;
			if(lim==number){
				lucky=1;
			}
		}
		else{
			continue;
		}
	}
	return lucky;
}
/**
@brief Це звичайний int main, у якому вказуюється шестизначне число, а друге шестизначне число генерується генератором псевдовипадкових чисел, після чого викликаеться функція, для визначення, щасливий цей квиток чи ні.
*/
int main(){
	srand(time(NULL));
	int first=194707,second=rand()%900000+100000,lucky1,lucky2;
	lucky1=luckycount(first);
	lucky2=luckycount(second);
	return 0;
}
